rottenpotatoes/app/controllers/movies_controller.rb

 def show_directors
    @movie = Movie.find(params[:id])
    if @movie.director.blank?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Dan Jurafsky"]]

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["release_date", "1992-11-16 00:00:00.000000"], ["updated_at", "2018-10-03 16:15:12.556874"], ["id", 1]]